Table of Contents
 Class IdeaSection
Namespace
IdeaStatiCa.BimApiLink.Results.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaSection : IIdeaSection
Inheritance
object
IdeaSection
Implements
IIdeaSection
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaSection(double)
public IdeaSection(double position)
Parameters
position double
Properties
 Position
Position on IIdeaMember1D/IIdeaElement1D. Value must be within 0 and 1 (including) where 0 is the start and 1 is the end.
public double Position { get; }
Property Value
double
 Results
Results on the section.
public IEnumerable<IIdeaSectionResult> Results { get; }
Property Value
IEnumerable<IIdeaSectionResult>
Methods
 Add(IIdeaSectionResult)
public void Add(IIdeaSectionResult sectionResult)
Parameters
sectionResult IIdeaSectionResult
 Edit this page